; -------------------------------------------------------------------------------------------------
;
; 7z SFX Builder Language File
;
; Translation Instructions:
;	File extension must be '.ini' in order to make 7z SFX Builder load language file.
;	DON'T remove SECTION NAMES! (ex: [LangOptions], [Global] ...)
;	Update your and language information in 'LangOptions' section
;	Save the file in Unicode format
;	E-mail new language files to mirza.b.1695@gmail.com for inclusion in main installer.
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function.
;	\n - indicates a newline character, which will be replaced when displayed.
;	\~n - indicates double newline character.
;	\s - indicates a special strings (generally file names)
;		The order and number of \s variables is very important and should not be modified.
;	\~s - same as \s. only quotes are added.
;
; -------------------------------------------------------------------------------------------------

[LangOptions]
LANG_NAME="Hungarian"
LANG_NATIVE_NAME="Magyar"
VERSION=2.0.7
NAME=Zsolt "lostprophet" Brechler
CONTACT=mailto:brekiking18@gmail.com

[Global]
TIP_ADD="Hozzáadás"
TIP_EDIT="Szerkesztés"
TIP_DELETE="Törlés"
TIP_DELETE_ALL="Mindet töröl"
TIP_MOVE_UP="Mozgatás fel"
TIP_MOVE_DOWN="Mozgatás le"
BTN_SAVE="Mentés"
BTN_CANCEL="Mégse"
CHK_QUOTES="Idézőjelek közé zárva"
LST_SEC_QUOTES="Idézőjelek"
ERROR_MSG_TITLE="Hiba!"
WARNING_MSG_TITLE="Figyelmeztetés"
INFORMATION_MSG_TITLE="Információ"
QUESTION_MSG_TITLE="Kérdés"
BTN_OK="Rendben"
TEST="Tesztelés"
TIP_BROWSE="Fájl tallózása"
TIP_OPEN="Fájl útvonal megnyitása"

[Menu]
MENU_FILE="&Fájl"
MENU_SETTINGS="&Beállítások"
MENU_HELP="&Súgó"
MI_OPEN="&Fájl megnyitása..."
MI_RELOAD="&Újranyitás"
MI_SAVE="&Mentés"
MI_SAVE_AS="Mentés m&int..."
MI_CLOSE="&Bezárás"
SUB_MENU_RECENT_FILES="&Legutóbbi fájlok"
MI_CLEAR_LIST="Lista &törlése"
MI_EXIT="K&ilépés"
MI_OPTIONS="&Beállítások"
SUB_MENU_LANG="&Nyelv"
MI_HELP="Sú&gó"
MI_SITE="&Projekt honlapja"
MI_ABOUT="N&évjegy"
MI_PRESET_MANAGER="Beállítás kezelő"

[ToolbarTips]
OPEN="Fájl megnyitása"
SAVE="Mentés"
SAVE_AS="Mentés mint"
CLOSE="Fájl bezárása"
TEST="Tesztelés"
PRESET="Beállítások kezelése"
MAKE_SFX="SFX létrehozása"
OPTIONS="Programbeállítások"

[TabNames]
MAIN="Főmenü"
TITLE_TEXT="Cím/Szöveg"
DIALOGS="Párbeszédek"
RUN="Futtatás"
DELETE="Törlés"
SHORTCUTS="Parancsikonok"
SET_ENV="Környezet beállítása"
OUTPUT="Kimenet"
SFX="SFX"

[Tab_Main]
CHK_TEMP_MODE="IdeiglenesMód"
CHK_SKIP_LOCKED="Rendszer által zárolt fájlok kihagyása"
CHK_DELETE_SFX="SFX fájl törlése a kicsomagolás után"
CHK_BPT="BeginPrompt időtúllépés:"
CHK_XDWIDTH="ExtractDialog szélesség:"
CHK_XPWIDTH="ExtractPath szélesség:"
RAD_OW_MODE_1="Minden fájl felülírása"
RAD_OW_MODE_2="Ne írja felül a fájlokat"
RAD_OW_MODE_3="Régebbi fájlok felülírása"
RAD_GUI_MODE_1="Teljes kezelőfelület mutatása"
RAD_GUI_MODE_2="'Mégse' letiltása a kicsomagoláskor"
RAD_GUI_MODE_3="Teljes kezelőfelület ablak elrejtése"
GRP_OW_MODE="Felülírási mód:"
GRP_GUI_MODE="Kezelőfelület mód:"
LBL_EXT_PATH="Kicsomagolási útvonal:"
MI_SFX_NAME="SFX neve"
MI_SFX_PATH="SFX útvonala"
TIP_EDIT="Kattints a szerkesztéshez"
TIP_INSERT="Kattints változók beillesztéséhez"
TIP_RELOAD="Újratölt"
TIP_OPEN="Megnyitás alapértelmezett szövegszerkesztővel"

[Tab_TitleText]
GRP_TITLE="Cím"
GRP_TEXT="Szöveg"
LBL_WIN_TITLE="Ablak címe:"
LBL_EXT_PATH_WIN_TITLE="Kicsomagolási útvonal ablak címe:"
LBL_EXT_WIN_TITLE="Kicsomagolási cím:"
LBL_ERROR_WIN_TITLE="Hibaüzenet címe:"
LBL_WARN_WIN_TITLE="Figyelmeztetés címe:"
LBL_PASSWD_TITLE="Jelszó címe:"
LBL_PASSWD_TEXT="Jelszó szövege:"
LBL_EXT_CANCEL_TEXT="Kicsomagolás megszakítás szövege:"

[Tab_RunProgram]
LST_SEC_PARAMETER="Paraméter"
LST_SEC_PREFIX="Előtag"
LST_SEC_FILE_FOLDER="Fájlútvonal"
LST_SEC_COMMANDS="Parancsok"

[Tab_Delete]
LST_SEC_PARAMETER="Paraméter"
LST_SEC_FILE_FOLDER="Fájl/Mappa útvonal"

[Tab_Shortcuts]
LST_SEC_PARAMETER="Paraméter"
LST_SEC_PATH="Útvonal"
LST_SEC_SRC="Forrás"
LST_SEC_CMDS="Parancsok"
LST_SEC_NAME="Név"
LST_SEC_DESC="Leírás"
LST_SEC_DEST="Célpont"
LST_SEC_WD="Munka mappa"
LST_SEC_ICON="Ikon"
LST_SEC_INDEX="Index"

[Tab_SetEnvironment]
LST_SEC_NAME="Változónév"
LST_SEC_VALUE="Érték"

[Tab_SFX]
BTN_SELECT="Kiválaszt..."
BTN_MAKE_SFX="SFX létrehozása"
BTN_SFX_OPTIONS="SFX beállítások"
BTN_EDIT_VERS="Verzió információ szerkesztése"
CHK_INCLUDE_PATH="Útvonal hozzáadása a konfigurációs fájlhoz"
CHK_USE_SELECTED_CFG="Kiválasztott konfogurációs fájl használata"
GRP_SFX_FILES="SFX fájlok"
GRP_SFX_ICON="Ikon"
LBL_CONFIG_FILE="Konfigurációs fájl:"
LBL_7Z_ARCHIVE="7z archívum:"
LBL_SFX_MODULE="SFX modul:"
LBL_SFX_PATH="SFX útvonal:"
LBL_SFX_ICON="SFX ikon:"

[GUI_ProgramOptions]
GUI_TITLE="Programbeállítások"
BTN_INTEGRATE="Program integrálása a jobbklikk menübe"
BTN_EXPORT="Exportálás..."
MI_REGISTRY="Rendszerleíró fájl..."
MI_INI="INI fájl..."
CHK_USERMODE="Beállítások mentése a rendszerleíróba"
CHK_AUTODEFMOD="Alapértelmezett modul automatikus használata, ha a betöltött beállításfájl nem tartalmazza"
CHK_IGNORE_EMPTY="Ne hozzon létre üres verzió információs kulcsokat"
CHK_AUTO_NAME_SFX="SFX fájl létrehozása az archívum mappájába, ha az SFX útvonal nincs megadva"
CHK_OVERWRITE_FILES="Létező SFX fájlok felülírása"
GRP_PROGRAM="Program"
GRP_SFX="SFX"
LBL_LANGUAGE="Kezelőfelület nyelve:"

[GUI_PresetManager]
GUI_TITLE="Beállítás kezelő"
BTN_NEW="Új beállítás"
GUI_TITLE3="Beállítás átnevezése"
BTN_NEW="Új"
BTN_LOAD="Betöltés"
BTN_SAVE="Mentés"
BTN_EDIT="Név szerkesztése"
BTN_DELETE="Törlés"
LBL_NAME="Beállítás neve:"

[GUI_ArchiveSets]
CHK_SUBFILES="Csak a megadott mappában található fájlok/mappák archiválása"
LBL_DRAGDROP="Húzd és vidd módszerrel is hozzáadhatsz fájlokat/mappákat"
TIP_ADDFILE="Fájl(ok) hozzáadása"
TIP_ADDFOLDER="Mappa hozzáadása"

[GUI_SFXOpts]
GUI_TITLE="SFX beállítások"
TAB_SFX_OPTIONS="SFX beállítások"
TAB_ARCHIVE_FILES="Archív fájlok"
CHK_USE_UPX="SFX modul tömörítése UPX-szel"
CHK_USE_SFX_MOD="Következő SFX modul használata:"
CMB_USE_7ZIP1="Használjon mindig 7-Zipet"
CMB_USE_7ZIP2="Csak akkor használjon 7-Zipet, ha az archívum fájlok meg vannak határozva"
CMB_USE_7ZIP3="Ne használja a 7-Zipet, ha 7z Archívum van megadva"
CMB_USE_7ZIP4="Sose használja a 7-zipet"
LBL_PATH="7-Zip útvonal"
TIP_BROWSE="7-zip útvonal kiválasztása"
TIP_CONFIG="7-Zip beállítások"
7ZIP_TITLE="7-Zip beállítások"
7ZIP_LEVEL="Tömörítési szint:"
7ZIP_METHOD="Tömörítési mód:"
7ZIP_DICT="Könyvtár mérete:"
7ZIP_SOLID="Solid Block size:"

[GUI_VersionInfo]
GUI_TITLE="Fájlverzió információ szerkesztése"
BTN_LOAD="Betöltés"
MI_LOAD_SFXMOD="Kiválasztott SFX modulból"
MI_LOAD_FILE="Fájlból..."
MI_LOAD_VALUES="Mentés betöltése"
MI_SAVE_VALUES="Jelenlegi értékek mentése"
CHK_INCLUDE="Információ hozzáadása a konfigurációs fájlhoz"
CHK_CHANGE_VERS="Verzió információ megváltoztatása"

[GUI_Gui.MiscFlags]
GUI_TITLE="Kezelőfelület/egyéb zászlók szerkesztése"
BTN_NEW="Új"
BTN_LOAD="Betöltés"
BTN_RESET="Visszaállítás"
BTN_DELETE="Törlés"
LBL_GUI_FLAG_1="Kicsomagolási százalék mutatása a címsorban a jobb oldalon (alapbeállításon - bal oldalon)"
LBL_GUI_FLAG_2="Ne jelenítse meg a kicsomagolási százalékot a címsorban"
LBL_GUI_FLAG_4="Kicsomagolási százalék megjelenítése a folyamatsáv alatt"
LBL_GUI_FLAG_8="Windows XP stílusok használata (séma)"
LBL_GUI_FLAG_16="Félkövér betűtípus használata a kicsomagolási százaléknál"
LBL_GUI_FLAG_32="Ikon megjelenítése a kicsomagolási százalék ablakában"
LBL_GUI_FLAG_64="'BeginPrompt' ablak használata a kicsomagolási útvonal megadásához"
LBL_GUI_FLAG_128="Különálló ablak használata a kicsomagolási útvonal megadásához"
LBL_GUI_FLAG_256="Telepítés/kicsomagolás leállításának megszüntetése"
LBL_GUI_FLAG_512="Ne mutasson ikont az ablakok címsorában és [Alt+Tab] esetén"
LBL_GUI_FLAG_1024="Ikon megjelenítése a kicsomagolási útvonal megadásának ablakában"
LBL_GUI_FLAG_2048="Ikon megjelenítése a 'BeginPrompt' ablakban"
LBL_GUI_FLAG_4096="Ikon és gombnevek megváltoztatása. Az 'Igen'-'Nem' helyett legyen 'Rendben'-'Mégse'"
LBL_GUI_FLAG_8192="Ne mutassa a folyamatsávot a tálcán Windows 7 vagy újabb rendszer alatt"
LBL_GUI_FLAG_16384="'&&' szimbólum mutatása a szövegekben"
LBL_MISC_FLAG_1="Ne ellenőrizze a kicsomagoláshoz szükséges szabad helyet"
LBL_MISC_FLAG_2="Ne ellenőrizze a kicsomagoláshoz szükséges szabad memóriát"
LBL_MISC_FLAG_4="Rendszergazdai jogosultságok szükségessége minden művelet esetén"
LBL_MISC_FLAG_8="Jelszó megadási ablak megjelenítése a 'BeginPrompt' és 'ExtractPath' ablakok után"

[GUI_RunProgram]
GUI_TITLE="Programok futtatása a kicsomagolás után"
GUI_PFX_TITLE="Előtagok szerkesztése"
LBL_PARAMETER="Paraméter:"
LBL_FILE="Fájl:"
LBL_PREFIX="Előtag:"
LBL_COMMANDS="Parancsok:"

[GUI_Delete]
GUI_TITLE="Fájlok törlése a kicsomagolás után"
LBL_PARAMETER="Paraméter:"
LBL_FILE="Fájl/Mappa:"

[GUI_Shortcuts]
GUI_TITLE="Parancsikonok létrehozása"
RAD_DESKTOP="Asztal"
RAD_START_MENU="Start menü"
RAD_PROGRAMS="Start menü\Programok"
RAD_STARTUP="Indítópult"
RAD_CURRENT_USER="Jelenlegi felhasználó"
RAD_ALLUSERS="Minden felhasználó"
GRP_CREATION_PATH="Létrehozás helye"
GRP_CREATE_FOR="Létrehozás:"
GRP_PARAMETER="Paraméter:"
LBL_SOURCE_FILE="Forrásfájl:"
LBL_ARGUMENTS="Argumentumok:"
LBL_NAME="Parancsikon neve:"
LBL_DESCRIPTION="Parancsikon leírása:"
LBL_DEST_FOLDER="Célmappa:"
LBL_WORKING_DIR="Munka mappa:"
LBL_ICON_FILE="Ikonfájl:"
LBL_ICON_INDEX="Ikon index:"

[GUI_SetEnvironment]
GUI_TITLE="Környezeti változók létrehozása"
LBL_NAME="Név:"
LBL_VALUE="Érték:"

[GUI_MakeSFX]
GUI_TITLE="SFX létrehozása..."
BTN_OPEN="Tallózás"
BTN_RUN="SFX futtatása"
BTN_CLOSE="Bezár"
REPORT_PREP="Felkészülés..."
REPORT_ARCHIVE1="Archívum létrehozása..."
REPORT_ARCHIVE2="7-Zip nem létezik!"
REPORT_ARCHIVE3="Fájl nem létezik: \~s"
REPORT_ARCHIVE4="Archívum sikeresen létrehozva"
REPORT_ARCHIVE5="Nem sikerült létrehozni az archívumot!"
REPORT_ERROR1="Konfigurációs fájl nem található: "%s""
REPORT_ERROR2="A következő fájl nem 7z SFX beállítási fájl: "%s""
REPORT_ERROR3="Hiba történt a SFX létrehozásakor!"
REPORT_ICON1="SFX ikon lecserélése..."
REPORT_ICON2="SFX ikon sikeresen lecserélve"
REPORT_ICON3="SFX ikon lecserélése nem sikerült!"
REPORT_VERSINFO1="Verzió információ frissítése..."
REPORT_VERSINFO2="Verzió információ sikeresen frissítve"
REPORT_VERSINFO3="Verzió információ frissítése nem lehetséges!"
REPORT_UPX1="Tömörítés UPX-szel..."
REPORT_UPX2="Tömörítés sikeresen befejezve"
REPORT_UPX3="Az "upx.exe" nem található!"
REPORT_BUILD1="SFX létrehozása..."
REPORT_BUILD2="Hiba történt az SFX létrehozása közben!"
REPORT_FINISH="SFX sikeresen létrehozva a(z) "%s" útvonalon"

[MessageBoxes]
; File open/save operations
MSGBOX1_1="Nyelvi fájl nem található!"
MSGBOX1_2="A megadott fájl nem létezik!"
MSGBOX1_3="A fájl nincs betöltve vagy nem létezik!"
MSGBOX1_4="A megadott beállítási fájl nem létezik!"
MSGBOX1_5="Szeretnéd megnyitni a következő fájlt: \~n\~s - ?"
MSGBOX1_6="\~s\nnem 7z SFX beállítási fájl!\~nMindenképp be szeretnéd tölteni?"
MSGBOX1_7="A fájlméret nagyobb, mint egy általános beállítási fájl!\nMindenképp be szeretnéd tölteni?"
MSGBOX1_8="A jelenlegi művelethez szükséges fájl hiányzik:\n\s"
MSGBOX1_9="Ez a fájl nem tartalmaz beállítási fájlt! Folytatás nem lehetséges!"
MSGBOX1_10="Szeretnéd újra betölteni a fájlt?"
MSGBOX1_11="A jelenlegi beállítások nincsenek elmentve. Szeretnéd ezt most megtenni?"
MSGBOX1_12="Fájl olvasása vagy írása nem lehetséges! Ellenőrizd, hogy rendelkezel-e rendszergazdai jogosultsággal."
; SFX creation
MSGBOX2_1="A meghatározott SFX fájl útvonala nem létezik!"
MSGBOX2_2="Az SFX modul nincs meghatározva!"
MSGBOX2_3="A meghatározott SFX modul nem létezik vagy nem megfelelő formátumú!"
MSGBOX2_4="Az archív fájlok nincsenek meghatározva!"
MSGBOX2_5="Az archívum nincs meghatározva!"
MSGBOX2_6="A meghatározott archívum nem létezik vagy nem megfelelő formátumú!"
MSGBOX2_7="Szeretnéd felülírni a következő fájlt: \~n\~s - ?"
MSGBOX2_8="A 7-Zip nem létezik!"
MSGBOX2_9="Szeretnéd a következő archív fájlt használni: \~n\~s - ?\~nKattints a 'Nem'-re, ha új archívumot szeretnél létrehozni a beállítási fájlban meghatározott fájlokból."
; Other operations
MSGBOX3_1="Program sikeresen integrálva a jobbklikk menübe."
MSGBOX3_2="Kattints a 'Rendben'-re az ablak bezárásához a tesztelés miatt"
MSGBOX3_3="Szeretnéd felülírni a létező értékeket?"
MSGBOX3_4="Kérlek válassz legalább egy elemet."
MSGBOX3_5="Kérlek csak egy elemet válassz."
MSGBOX3_6="Biztosan törölni szeretnéd a kiválasztott eleme(ke)t?"
MSGBOX3_7="Biztosan törölni szeretnéd az összes elemet?"
MSGBOX3_8="A megadott adatok érvénytelenek vagy üresek!"
MSGBOX3_9="A fájl nincs meghatározva!"
